<a href="https://colab.research.google.com/github/Eswar-11/DWDM/blob/main/dwdm03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Import pandas under the alias pd

In [36]:
import pandas as pd

Print the version of pandas that has been imported.

In [37]:
pd.__version__

'1.1.5'

Print out all the version information of the libraries that are required by the 
pandas library.

In [38]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : b5958ee1999e9aead1938c0bba2b674378807b3d
python           : 3.7.12.final.0
python-bits      : 64
OS               : Linux
OS-release       : 5.4.104+
Version          : #1 SMP Sat Jun 5 09:50:34 PDT 2021
machine          : x86_64
processor        : x86_64
byteorder        : little
LC_ALL           : None
LANG             : en_US.UTF-8
LOCALE           : en_US.UTF-8

pandas           : 1.1.5
numpy            : 1.19.5
pytz             : 2018.9
dateutil         : 2.8.2
pip              : 21.1.3
setuptools       : 57.4.0
Cython           : 0.29.24
pytest           : 3.6.4
hypothesis       : None
sphinx           : 1.8.5
blosc            : None
feather          : 0.4.1
xlsxwriter       : None
lxml.etree       : 4.2.6
html5lib         : 1.0.1
pymysql          : None
psycopg2         : 2.7.6.1 (dt dec pq3 ext lo64)
jinja2           : 2.11.3
IPython          : 5.5.0
pandas_datareader: 0.9.0
bs4              : 4.6.3
bottleneck       : 1.3.2
fsspec           : None
fastparquet      : None
gcsfs            : None
matplotlib       : 3.2.2
numexpr          : 2.7.3
odfpy            : None
openpyxl         : 2.5.9
pandas_gbq       : 0.13.3
pyarrow          : 3.0.0
pytables         : None
pyxlsb           : None
s3fs             : None
scipy            : 1.4.1
sqlalchemy       : 1.4.26
tables           : 3.4.4
tabulate         : 0.8.9
xarray           : 0.18.2
xlrd             : 1.1.0
xlwt             : 1.3.0
numba            : 0.51.2

Create a DataFrame df from this dictionary data which has the index labels.

import numpy as np 

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],

 'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3], 

 'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 

 'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
 
 labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [57]:
import numpy as np
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

Display a summary of the basic information about this DataFrame and its 
data.

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

Return the first 3 rows of the DataFrame df.

In [41]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

Select just the 'animal' and 'age' columns from the DataFrame df.

In [42]:
df.loc[:, ['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].

In [43]:
df.loc[df.index[[3, 4, 8]], ['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

Select only the rows where the number of visits is greater than 3.

In [44]:
df[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

Select the rows where the age is missing, i.e. it is NaN.

In [45]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

Select the rows where the animal is a cat and the age is less than 3.

In [46]:
df[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

Select the rows the age is between 2 and 4 (inclusive).

In [47]:
df[df['age'].between(2, 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

Change the age in row 'f' to 1.5.

In [48]:
df.loc['f', 'age'] = 1.5

Calculate the sum of all visits in df (i.e. find the total number of visits).

In [49]:
df['visits'].sum()

19

Calculate the mean age for each different animal in df.

In [50]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

Append a new row 'k' to df with your choice of values for each column. 
Then delete that row to return the original DataFrame.

In [51]:
df.loc['k'] = [5.5, 'dog', 'no', 2]

# and then deleting the new row...

df = df.drop('k')

Count the number of each type of animal in df.

In [52]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

Sort df first by the values in the 'age' in decending order, then by the value 
in the 'visits' column in ascending order (so row i should be first, and row d 
should be last).

In [53]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age visits priority
i    dog    7      2       no
e    dog    5      2       no
g  snake  4.5      1       no
j    dog    3      1       no
b    cat    3      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

The 'priority' column contains the values 'yes' and 'no'. Replace this column 
with a column of boolean values: 'yes' should be True and 'no' should be False.

In [54]:
df['priority'] = df['priority'].map({'yes': True, 'no': False})
df

  animal  age visits  priority
a    cat  2.5      1      True
b    cat    3      3      True
c  snake  0.5      2     False
d    dog  NaN      3      True
e    dog    5      2     False
f    cat  1.5      3     False
g  snake  4.5      1     False
h    cat  NaN      1      True
i    dog    7      2     False
j    dog    3      1     False

In the 'animal' column, change the 'snake' entries to 'python'.

In [55]:
df['animal'] = df['animal'].replace('snake', 'python')
df

   animal  age visits  priority
a     cat  2.5      1      True
b     cat    3      3      True
c  python  0.5      2     False
d     dog  NaN      3      True
e     dog    5      2     False
f     cat  1.5      3     False
g  python  4.5      1     False
h     cat  NaN      1      True
i     dog    7      2     False
j     dog    3      1     False

For each animal type and each number of visits, find the mean age. In other 
words, each row is an animal, each column is a number of visits and the values 
are the mean ages (hint: use a pivot table).

In [58]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
snake   4.5  0.5  NaN

You have a DataFrame df with a column 'A' of integers. 

For example: df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]}) 

How do you filter out rows which contain the same integer as the row 
immediately above? You should be left with a column containing the following 

values: 1, 2, 3, 4, 5, 6, 7

In [59]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.loc[df['A'].shift() != df['A']]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

Given a DataFrame of numeric values, say 

df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float 
values how do you subtract the row mean from each element in the row?

In [60]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0 -0.480211 -0.016040  0.496252
1  0.255884  0.247722 -0.503606
2  0.286545 -0.252258 -0.034287
3  0.230924 -0.304736  0.073813
4  0.112944 -0.337250  0.224306

Suppose you have DataFrame with 10 columns of real numbers, for 

example: df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abc 
defghij'))

Which column of numbers has the smallest sum? Return that column's label.

In [61]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df.sum().idxmin()

'i'

How do you count how many unique rows a DataFrame has (i.e. ignore all 
rows that are duplicates)? As input, use a DataFrame of zeros and ones with 10 
rows and 3 columns. 

df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3))

In [62]:
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
len(df.drop_duplicates(keep=False))

2

In the cell below, you have a DataFrame df that consists of 10 columns of 
floating-point numbers. Exactly 5 entries in each row are NaN values. 

For each row of the DataFrame, find the column which contains the third NaN 
value. 

You should return a Series of column labels: e, c, d, h, d 
nan = np.nan 

data =  [[0.04, nan, nan, 0.25, nan, 0.43, 0.71, 0.51, nan, nan], 
       
       [ nan, nan, nan, 0.04, 0.76, nan, nan, 0.67, 0.76, 0.16], 

       [ nan, nan, 0.5 , nan, 0.31, 0.4 , nan, nan, 0.24, 0.01], 

       [0.49, nan, nan, 0.62, 0.73, 0.26, 0.85, nan, nan, nan],
       
       [ nan, nan, 0.41, nan, 0.05, nan, 0.61, nan, 0.48, 0.68]] 

columns = list('abcdefghij') df = pd.DataFrame(data, columns=columns)

In [63]:
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columns = list('abcdefghij')

df = pd.DataFrame(data, columns=columns)

(df.isnull().cumsum(axis=1) == 3).idxmax(axis = 1)

0    e
1    c
2    d
3    h
4    d
dtype: object

A DataFrame has a column of groups 'grps' and and column of integer 
values 'vals': 

df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
 'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]}) 

For each group, find the sum of the three greatest values. You should end up 
with the answer as follows: 

grps 

a   409 

b   156 

c   345

In [64]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
print(df)
df.groupby('grps')['vals'].nlargest(3).sum(level=0)

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

grps
a    409
b    156
c    345
Name: vals, dtype: int64

The DataFrame dfconstructed below has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive). 

For each group of 10 consecutive integers in 'A' (i.e. (0, 10], (10, 20], ...), calculate the sum of the corresponding values in column 'B'.

The answer should be a Series as follows:

A

(0,10] 635

(10,20] 360

(20,30] 315

(30,40] 306

(40,50] 750

(50,60] 284

(60,70] 424

(70,80] 526

(80,90] 835

(90,100] 852

df=pd.DataFrame(np.random.RandomState(8765).randint(1,101,size=(100,2)),columns=["A","B"])

In [65]:
df = pd.DataFrame(np.random.RandomState(8765).randint(1, 101, size=(100, 2)), columns = ["A", "B"])
print(df)
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()

     A   B
0   46  29
1   75  22
2   49  63
3   33  43
4   71  75
..  ..  ..
95  60  87
96  57  40
97  86  19
98  50  56
99  97  94

[100 rows x 2 columns]

A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
Name: B, dtype: int64